<template>
  <el-dialog
      :visible.sync="dialogVisible"
      title="提示"
      top="2vh"
      :modal="false"
      :before-close="bClose"
    >
    <div class="container">
     <!-- 回复弹框 -->
    <div class="content-container markdown-body animated fadeIn">
      <h1 style="text-align: center;">用户协议</h1>
      <h3>导言</h3>
      <p>欢迎使用“石景山区文化产业综合服务平台”以及相关服务！</p>
      <p>为了更好地向您提供服务，请您在使用“石景山区文化产业综合服务平台”及相关服务之前，认真阅读并理解本协议。</p>
      <h3>第一章 提示条款</h3>
      <p>您在申请注册流程中点击或选择同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。</p>
      <p>当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与乙方达成一致，成为平台用户。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。</p>
      <p>本协议可由乙方随时更新，更新后的协议条款一旦公布即代替原来的协议条款，不再另行个别通知。您可在网站查阅最新版协议条款。在乙方修改本协议条款后，如果您不接受修改后的条款，请立即停止使用乙方提供的服务，您继续使用乙方提供的服务将被视为已接受了修改后的协议。</p>
      <h3>第二章 定义</h3>
      <p>2.1 平台：指运营主体为                   公司（下称“乙方”或本公司）及其关联公司，为用户提供平台网络空间等技术服务的网络服务平台。</p>
      <p>2.2 平台规则：包括所有在平台内已经发布及后续发布的全部协议、规则、解读、公告等内容以及各平台发布的各类规则、实施细则、产品流程说明、公告等。</p>
      <p>2.3 平台用户：指在平台合法注册，接受并认可平台规则的自然人、法人或非法人组织，简称“用户”。</p>
      <p>2.4 服务商：是指按照平台相关规则及本协议约定，拟向项目方提供服务的自然人、法人或其他组织。</p>
      <p>2.5 项目方：指拟在平台上发起项目的自然人、法人或其他组织，并欲通过平台发布服务需求。</p>
      <h3>第三章 您的注册义务</h3>
      <p>3.1 为了能使用本平台相关服务，您需要：</p>
      <p>（1）您必须选择注册成为本服务之用户。</p>
      <p>（2）您同意遵守所有与本平台服务相关之国内国际法律及规定，并同意不冒用或盗用他人的身份或者干扰他人使用本服务。</p>
      <p>（3）必须依服务注册表或其他注册文件之提示提供您正确、最新及完整的资料（以下称“登记资料”， 包含并不仅限于您的姓名/企业名称、身份证号码或其他有效证件号码（个人敏感信息）、证件照片（个人敏感信息）、银行卡卡号（个人敏感信息）、手机号码（个人敏感信息）、营业执照、企业法定代表人姓名和身份证号（个人敏感信息）、企业法定代表人身份证（个人敏感信息）、联系邮箱、企业地址、开具发票信息、行业类型一切必要信息，即注册表中标注“*”符号的栏位信息，并保证不使用他人的资料注册。</p>
      <p>（4）您有义务维护并立即更新“登记资料”，确保登记资料的合法性、真实性、准确性和完整性。若您提供任何错误、不实、过时或不完整的资料，或者本公司有合理的理由怀疑提交的“登记资料”为错误、不实、过时或不完整，乙方有权暂停或终止您的用户账户，并拒绝现在或未来使用本服务之部分或全部，您同意承担因此所产生的直接或间接的一切后果和法律责任。</p>
      <p>（5）您应确保用户账户和密码仅由您或您指定授权人使用，不得将账户用于本协议约定范围以外的其他用途。乙方严厉禁止使用非您单位的用户账户和密码，或者将您单位的用户账户和密码转让或出租给他人使用。使用他人用户账户和密码者与该用户账户和密码的实际注册人应承担相关的所有法律责任。</p>
      <p>（6）您使用本平台的相关服务时，应确保自身操作的合法性、真实性、有效性和完整性。</p>
      <p>（7）您应承诺发起的交易基于真实的交易背景，不得利用本公司提供的服务进行虚假交易。</p>
      <p>（8）您应承诺不利用本公司的服务从事任何非法行为，不违反中国法律、法规、规章、规范性文件及政策，不侵犯他人的合法权益。</p>
      <p>（9）如任何第三方向乙方投诉，乙方经核实后，有权要求您配合解决该投诉。如出现不符合法律法规、政策规定或侵犯第三方合法权益的内容的，乙方有权在不通知您的情况下做下线处理。但是，判断和发现异常交易或有疑异或违法之交易，并不构成乙方的一项义务和责任。</p>
      <p>3.2 补充协议 平台各项法律声明/政策、知识产权声明、隐私保护政策及平台规则均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如您使用平台服务，视为您同意上述补充协议。</p>
      <h3>第四章 账号注册、使用与注销</h3>
      <p>4.1用户资格
您确认，在您开始注册程序使用平台服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力，具体是： /或平台信息安全的，乙方可拒绝提供相应服务或终止本协议。</p>
      <p>（1）年满十八岁具备完全民事权利能力和民事行为能力的自然人；</p>
      <P>（2）经过其监护人同意的无民事行为能力人或限制民事行为能力人；</P>
      <p>（3）据中国法律法规成立并合法存在的机关、企事业单位、社团组织和其他组织。</p>
      <p>若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。此外，您还需遵从国家相关法律法规，并确保您不是任何国家、国际组织或者地域实施的贸易限制、制裁或其他法律、规则限制的对象，否则您可能无法正常注册及使用平台服务。</p>
      <p>4.2 账户说明</p>
      <p>（1）您应当确保账户是由您本人或您的合法授权人进行注册获得，而非冒用他人信息或未经合法授权以及其他非法方式进行注册获得。当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，您可获得平台账户并成为平台用户。</p>
      <p>（2）您有权使用您设置或确认的平台昵称、邮箱、手机号码（以下简称“账户名称”）及您设置的密码（账户名称及密码合称“账户”）登录平台，由于您的账户关联您的信息及平台商业信息，您的账户仅限您本人使用。您将对使用该用户账户及密码所进行的一切活动，负完全的责任，并同意遵守和执行以下事项：</p>
      <p> 1）用户账户和密码遭到冒用、盗用或有其他任何影响安全的问题发生时，请立即通知本公司。</p>
      <p> 2）为了保证用户账户和密码安全，请避免在公共计算机上或网吧中使用本服务。</p>
      <p> 3）每次连线完毕，请确认已退出账户登录。</p>
      <p> 4）您及您指定操作人不可向其他任何人泄露、透露、告知用户账户和密码，亦不可使用其他任何人的用户账户和密码。由于您自身原因或不可归责于乙方的原因导致的用户账户和密码被其他任何人知悉，造成的用户账户和/或密码被他人使用导致损失的，乙方不承担任何责任。您可以注销账号。您可以自助发起注销申请，平台审核通过后为您注销账户。 如您注销账号，请按照平台相关规定妥善处理资金等事宜。</p>
      <p> 5）同意于发现有他人冒用或盗用您用户账户及密码，或其他任何未经合法授权之情形时，应立即通知乙方，要求停止其使用本服务并采取防范之措施。乙方于接受有效通知前，对他人使用本服务已发生之效力和后果，除非可证明乙方对未经合法授权之使用的形成存在故意或重大过失，否则乙方将不承担任何责任。若您迟延通知，则迟延期间产生的损失，乙方将不需承担任何责任。</p>
      <p> 6）检查、监控和发现是否有他人冒用或盗用您的用户账户及密码，或其他任何未经合法授权之情形，是您的义务和责任。</p>
      <p> 7）账户因您自身原因泄露或因您遭受他人攻击（含您使用的计算机被他人侵入）、诈骗等行为导致的损失及后果，平台并不承担责任，您应通过司法、行政等救济途径向侵权行为人追偿。=服务费×管理费率，服务费是项目方基于服务商向其提供的服务而向服务商支付的费用。管理费费率等具体收费标准及收费方式以平台显示为准。</p>
      <p>（3）如乙方根据平台规则中约定的违约认定程序及标准判断您账户的使用可能危及您的账户安全及/或平台信息安全的，乙方可拒绝提供相应服务或终止本协议。</p>
      <p>（4）由于用户账户关联用户信用信息，仅当有法律明文规定、司法裁定或乙方同意的情况下，您可进行账户的转让，除此之外的情况，您不得进行账户转让。否则乙方有权追究您的违约责任，且由此产生的一切责任均由您承担。</p>
      <p>（5）作为平台经营者，为使您更好地使用平台的各项服务，保障您的账户安全，乙方可要求您按平台规则要求及我国法律规定完成实名认证。平台用户账号归属以该账号实名认证信息为准，如您未进行实名认证的，将影响到您正常使用平台的各项服务和权益保障。</p>
      <p>（6）账号因所属人不明的情况产生纠纷或其他因司法行政等国家公职部门工作要求的情况下，乙方有权对账号进行锁定处理。</p>
      <p>（7）乙方有权对满足特定条件的账户做出不活跃账户的判定，并对该账户予以回收处理，具体条件如下：</p>
      <p>1）连续180天未登陆平台；</p>
      <p>2）不存在未到期的有效业务。</p>
      <p>4.3 账户信息管理</p>
      <p>在使用平台服务时，您应当按平台页面的提示准确完整地提供您的信息（包括但不限于您的姓名及电子邮件地址、联系电话、联系地址等）。您了解并同意，您有义务保持您提供信息的真实性及有效性。如您未提供准确完整的信息，将影响到您正常使用平台的各项服务和权益保障。
如平台按您最后一次提供的信息与您联系未果、您未按平台的要求及时提供信息、您提供的信息存在明显不实或经行政司法机关核实您提供的信息无效的，您将承担因此对您自身、他人及平台造成的全部损失与不利后果。平台可向您发出询问或要求整改的通知，并要求您进行重新认证，直至中止、终止对您提供部分或全部平台服务，平台对此不承担责任。</p>
      <h3>第五章 用户信息的保护与授权</h3>
      <p>5.1 非个人信息的保证与授权</p>
      <p>您声明并保证，您对您所发布的信息拥有相应、合法的权利。否则，乙方可对您发布的信息依法或依本协议进行删除或屏蔽。</p>
      <p>您应当确保您所发布的信息不包含以下内容：</p>
      <p>1) 违反国家法律法规禁止性规定的；</p>
      <p>(2) 政治宣传、封建迷信、淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；</p>
      <p>(3) 欺诈、虚假、不准确或存在误导性的；</p>
      <p>(4) 侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；</p>
      <p>(5) 侮辱、诽谤、恐吓、涉及他人隐私等侵害他人合法权益的；</p>
      <p>(6) 存在可能破坏、篡改、删除、影响平台任何系统正常运行或未经授权秘密获取平台及其他用户的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的；</p>
      <p>(7) 其他违背社会公共利益或公共道德或依据相关平台协议、规则的规定不适合在平台上发布的。对于您提供、发布及在使用平台服务中形成的除个人信息外的文字、图片、视频、音频等非个人信息，在法律规定的保护期限内您免费授予乙方获得全球排他的许可使用权利及再授权给其他第三方使用并可以自身名义对第三方侵权行为取证及提起诉讼的权利。您同意乙方存储、使用、复制、修订、编辑、发布、展示、翻译、分发您的非个人信息或制作其派生作品，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。</p>
      <p>5.2 平台信息保护</p>
      <p>未经乙方书面允许，您不得将平台的任何资料以及在交易平台上所展示的任何信息作商业性利用。</p>
      <h3>第六章 免责声明</h3>
      <p>6.1 平台仅为用户开展交易提供信息展示服务，是否发布信息、信息是否真实、参与交易与否、业务成交与否、订单能否实际履行等一系列与交易相关的信息，均无法由平台强制实现与执行，需要依赖于用户与第三方独立判断并实施，平台对此不做任何承诺与保证，亦无需为此承担任何责任。</p>
      <p>6.2 乙方在为用户推荐服务商的情形下，乙方不参与项目方与服务商之间的委托代理合同关系，项目方与服务供应商之间的纠纷，乙方不承担任何法律责任。</p>
      <p>6.3 乙方对用户提交的经营资质文件、信息资料、商户信息等内容的审核仅为形式上的审核，不对其合法性、真实性、准确性、有效性等作任何保证，亦不承担任何法律责任。若用户提交虚假、过期资料，或发布含有违法侵权内容的信息，而导致投诉索赔、诉讼纠纷、行政处罚的，由用户自行承担全部法律责任；如因此造成乙方经济损失的，用户应予以赔偿。</p>
      <p>6.4 乙方对于下述原因导致的合同履行障碍、履行瑕疵、履行延后或履行内容变更等情形，乙方并不承担相应的违约责任：</p>
      <p>（1）因自然灾害、罢工、暴乱、战争、政府行为、司法行政命令等不可抗力因素；</p>
      <p>（2）因电力供应故障、通讯网络故障等公共服务因素或第三人因素；</p>
      <p>（3）在乙方已尽善意管理的情况下，因常规或紧急的设备与系统维护、设备与系统故障、网络信息与数据安全等因素。</p>
      <p>6.5 您应当明确了解并同意：乙方不能随时预见到任何技术上的问题或其他困难。该等困难可能会导致数据损失或其他服务中断。</p>
      <h3>第七章 商标、知识产权的保护</h3>
      <p>7.1 乙方及关联公司所有系统及本网站上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由乙方或乙方关联企业依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。</p>
      <p>7.2 非经乙方或乙方关联企业书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表本网站程序或内容。</p>
      <p>7.3 尊重知识产权是您应尽的义务，如有违反，您应承担损害赔偿责任。</p>
      <h3>第八章 通知</h3>
      <p>8.1 有效的通知方式</p>
      <p>您在注册成为平台用户，并接受平台服务时，您应该向乙方提供真实有效的联系方式（包括但不限于您的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被联系的状态。
您在注册平台用户时生成的用于登陆平台接收站内信、系统消息和即时信息的会员账号，也将视为您的有效联系方式。
乙方将向您的上述联系方式的其中之一或其中若干向您送达各类通知，而此类通知的内容可能对您的权利义务产生重大的有利或不利影响，请您务必关注。
您可通过您注册时填写的手机号码或者电子邮箱获取您感兴趣的商品广告信息、促销优惠等商业性信息；您如果不愿意接收此类信息，您有权联系平台客服人员处理。</p>
      <p>8.2通知的送达</p>
      <p>乙方通过上述联系方式向您发出通知，其中以电子的方式发出的书面通知，包括但不限于在平台公告，向您提供的联系电话发送手机短信，向您提供的电子邮件地址发送电子邮件，向您的账号发送即时信息、系统消息以及站内信信息，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。
对于在平台上因交易活动引起的任何纠纷，您同意司法机关（包括但不限于人民法院）可以通过手机短信、电子邮件或即时信息等现代通讯方式或邮寄方式向您送达法律文书（包括但不限于诉讼文书）。您指定接收法律文书的手机号码、电子邮箱或平台账号等联系方式为您在平台注册、更新时提供的手机号码、电子邮箱联系方式以及在注册平台用户时生成平台账号，司法机关向上述联系方式发出法律文书即视为送达。您指定的邮寄地址为您的法定联系地址或您提供的有效联系地址。
您同意司法机关可采取以上一种或多种送达方式向您达法律文书，司法机关采取多种方式向您送达法律文书，送达时间以上述送达方式中最先送达的为准。
您同意上述送达方式适用于各个司法程序阶段。如进入诉讼程序的，包括但不限于一审、二审、再审、执行以及督促程序等。
您应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达，或未及时送达由您自行承担由此可能产生的法律后果。</p>
      <h3>第九章 协议的终止</h3>
      <p>9.1 终止的情形</p>
      <p>（1）您有权通过以下任一方式终止本协议：</p>
      <p>1)在满足平台公示的账户注销条件时您通过网站自助服务注销您的账户；</p>
      <p>2)变更事项生效前您停止使用并明示不愿接受变更事项的；</p>
      <p>3)您明示不愿继续使用平台服务，且符合平台终止条件的。</p>
      <p>（2）出现以下情况时，乙方可以通知您终止本协议：</p>
      <p>1)您违反本协议约定，乙方依据违约条款终止本协议的；</p>
      <p>2)您盗用他人账户、发布违禁信息、骗取他人财物、售假、扰乱市场秩序、采取不正当手段谋利等行为，乙方依据平台规则对您的账户予以查封；</p>
      <p>3)您的注册资料中主要内容是虚假的，乙方有权随时终止本协议；</p>
      <p>4)除上述情形外，因您多次违反平台规则相关规定且情节严重，乙方依据平台规则对您的账户予以查封的；</p>
      <p>5)您的账户被乙方依据本协议回收的；</p>
      <p>6)您在平台有欺诈、发布或销售假冒伪劣/侵权商品、侵犯他人合法权益或其他严重违法违约行为的；</p>
      <p>7)其它应当终止服务的情况。</p>
      <p>9.2 协议终止后的处理</p>
      <p>本协议终止后，除法律有明确规定外，乙方无义务向您或您指定的第三方披露您账户中的任何信息。您再一次直接或间接或以他人名义注册为乙方用户的，乙方有权拒绝或者在注册成功后单方面再次终止本协议。</p>
      <p>本协议终止后，对于您在本协议存续期间产生的交易订单，乙方可通知交易相对方并根据交易相对方的意愿决定是否关闭该等交易订单；如交易相对方要求继续履行的，则您应当就该等交易订单继续履行本协议及交易订单的约定，并承担因此产生的任何损失或增加的任何费用。</p>
      <h3>第十章 法律适用、管辖与其他</h3>
      <p>10.1本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律；如法律无相关规定的，参照商业惯例及/或行业惯例。</p>
      <p>10.2您因使用平台服务所产生及与平台服务有关的争议，由乙方与您协商解决。协商不成时，则任何一方均应将争议提交至乙方所在地的法院进行诉讼。</p>
      <p>10.3本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。</p>
      <p>10.4乙方服务协议包括基于本服务协议制定的各项规则拥有最终解释权。</p>
      <p>10.5 本协议自贵司您通过平台勾选或点击接受并同意之日起生效，有效期至本协议被解除或终止之日。</p>
    </div>
  </div>
    </el-dialog>
</template>

<script>
import AppHeader from '@/components/Header/index'

export default {
  name: 'Terms',
  components: {
    AppHeader
  },
  props: {
    dialogVisible: {
      type: Boolean,
      default: false,
    },
  },
  data() {
      return {
        reEditVisible: true
      };
    },
    methods: {
      bClose() {
        this.$emit('closeDialog');
      }
    }
}
</script>

<style lang="scss" scoped>
.container {
  @import '~@/styles/variables';
  width: 100%;
  height: 100vh;
  overflow-x: hidden;
  overflow-y: -webkit-overlay;
  overflow-y: overlay;

  .content-container {
    background: #fff;
    max-width: 720px;
    margin: 0 auto;
    margin-top: 15px;
    border-radius: 2px;
    font-size: 15px;
    box-sizing: border-box;
    padding: 15px;
    margin-bottom: 20px;

    @media screen and (max-width: 922px){
      margin-top: 0;
    }
  }
}
</style>
